
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИмяПользователя = ИмяПользователя();
	ЭтотОбъект.Владелец = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//Если ПроверкаДубляПоВладельцу() Тогда
	//	Сообщить("ИНН уже используется");
	//	Отказ = Истина;
	//КонецЕсли;
КонецПроцедуры

Функция ПроверкаДубляПоВладельцу()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Контрагенты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	(Контрагенты.Владелец = &Владелец
	                      |			ИЛИ Контрагенты.Владелец = &Администратор)
	                      |	И Контрагенты.ИНН = &ИНН"); 
	Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Владелец);
	Запрос.УстановитьПараметр("Администратор", Справочники.Пользователи.НайтиПоНаименованию("Администратор"));
	Запрос.УстановитьПараметр("ИНН", ЭтотОбъект.ИНН);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции