
&НаКлиенте
Процедура ОтходыОтходОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  
	
	Наименование = ПолучитьНаименование(ВыбранноеЗначение);
	ТекущийЭлемент.ТекущиеДанные.ОтходНаименование = Наименование;     
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименование(ВыбранноеЗначение)
	
	Возврат ВыбранноеЗначение.НаименованиеПолное;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РаботаСRabbitMQ.ОтправитьСообщениеКлиент(Объект.Номер);  
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИД);
	КонецЕсли;     
	
	ЗапуститьНаСервереКонец();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		//УИД = ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение", Истина, Истина);
		ЗапуститьНаСервереНачало();                                                       
	КонецЕсли;
КонецПроцедуры               

&НаСервере
Процедура ЗапуститьНаСервереНачало()
	ВремяНачала	=	ОценкаПроизводительности.НачатьЗамерВремени();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервереКонец()
	ОценкаПроизводительности.ЗакончитьЗамерВремени("Проведение", ВремяНачала, 1);
КонецПроцедуры
