
&НаКлиенте
Процедура Сформировать(Команда) 
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьНаСервере(ТабличныйДокумент);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабличныйДокумент)  
	
	//ТабДок = Отчет.ТабДок;
	
	Макет = Отчеты.ОтчетОтходыПоПериуду.ПолучитьМакет("Раздел1");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("СтрокаОтхода");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АВТОНОМЕРЗАПИСИ() КАК Номер,
	                      |	ОтходыПолученныеОбороты.Организация КАК Организация,
	                      |	ОтходыПолученныеОбороты.Отход КАК Отход,
	                      |	ОтходыПолученныеОбороты.КоличествоОборот КАК КоличествоОборот,
	                      |	ПОДСТРОКА(ОтходыПолученныеОбороты.Отход.Наименование, 16, 1) КАК Поле1
	                      |ПОМЕСТИТЬ ВТ_Основная
	                      |ИЗ
	                      |	РегистрНакопления.ОтходыПолученные.Обороты(&Начало, &Конец, , Организация = &Организация) КАК ОтходыПолученныеОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Основная.Номер КАК НомерСтроки,
	                      |	ВТ_Основная.Отход КАК ОтходКод,
	                      |	ВТ_Основная.КоличествоОборот КАК ОтходКоличество,
	                      |	ВТ_Основная.Поле1 КАК ОтходОпасность,
	                      |	ВТ_Основная.Отход.НаименованиеПолное КАК ОтходНаименование
	                      |ИЗ
	                      |	ВТ_Основная КАК ВТ_Основная");
	Запрос.УстановитьПараметр("Начало", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Конец", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	
	Результат = Запрос.Выполнить().Выбрать(); 
	
	ТабДок.Очистить(); 
	ТабДок.Вывести(Шапка);
	
	Пока Результат.Следующий() Цикл
		
		Строка.Параметры.Заполнить(Результат);
		ТабДок.Вывести(Строка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Квартальный1(Команда)
	Квартальный1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Квартальный1НаСервере()
	Макет = Отчеты.ОтчетОтходыПоПериуду.ПолучитьМакет("Квартальный1");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АВТОНОМЕРЗАПИСИ() КАК Номер,
	                      |	РЭ_ОтходыКонтрагентовОбороты.Организация КАК Организация,
	                      |	РЭ_ОтходыКонтрагентовОбороты.Отход КАК Отход,
	                      |	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК КоличествоОборот,
	                      |	ПОДСТРОКА(РЭ_ОтходыКонтрагентовОбороты.Отход.Наименование, 16, 1) КАК Поле1
	                      |ПОМЕСТИТЬ ВТ_Основная
	                      |ИЗ
	                      |	РегистрНакопления.ОтходыПолученные.Обороты(&Начало, &Конец, , Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Основная.Номер КАК НомерСтроки,
	                      |	ВТ_Основная.Отход КАК ОтходКод,
	                      |	ВТ_Основная.КоличествоОборот КАК ОтходКоличество,
	                      |	ВТ_Основная.Поле1 КАК ОтходОпасность,
	                      |	ВТ_Основная.Отход.НаименованиеПолное КАК ОтходНаименование
	                      |ИЗ
	                      |	ВТ_Основная КАК ВТ_Основная");
	Запрос.УстановитьПараметр("Начало", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Конец", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	
	Результат = Запрос.Выполнить().Выбрать(); 
	
	ТабДок.Очистить(); 
	
	Шапка.Параметры.Период = Формат(Отчет.Период.ДатаНачала, "ДЛФ=D") + " по " + Формат(Отчет.Период.ДатаОкончания, "ДЛФ=D");
	ТабДок.Вывести(Шапка);
	
	Пока Результат.Следующий() Цикл
		
		Строка.Параметры.Заполнить(Результат);
		ТабДок.Вывести(Строка);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Квартальный2(Команда)
	Квартальный2НаСервере();
КонецПроцедуры

&НаСервере
Процедура Квартальный2НаСервере() 
	
	Макет = Отчеты.ОтчетОтходыПоПериуду.ПолучитьМакет("Квартальный2");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РЭ_ОтходыКонтрагентовОбороты.Организация КАК Организация,
	                      |	РЭ_ОтходыКонтрагентовОбороты.Отход КАК Отход,
	                      |	РЭ_ОтходыКонтрагентовОбороты.КоличествоОборот КАК КоличествоОборот,
	                      |	ПОДСТРОКА(РЭ_ОтходыКонтрагентовОбороты.Отход.Наименование, 16, 1) КАК Поле1,
	                      |	РЭ_ОтходыКонтрагентовОбороты.Контрагент КАК Контрагент
	                      |ПОМЕСТИТЬ ВТ_Основная
	                      |ИЗ
	                      |	РегистрНакопления.ОтходыПолученные.Обороты(&Начало, &Конец, , Организация = &Организация) КАК РЭ_ОтходыКонтрагентовОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Основная.Отход КАК ОтходКод,
	                      |	ВТ_Основная.КоличествоОборот КАК ОтходКоличество,
	                      |	ВТ_Основная.Поле1 КАК ОтходОпасность,
	                      |	ВТ_Основная.Отход.НаименованиеПолное КАК ОтходНаименование,
	                      |	ВТ_Основная.Контрагент КАК ОтходКонтрагент,
	                      |	РЭ_Контрагенты.Договор КАК ОтходДоговор
	                      |ИЗ
	                      |	ВТ_Основная КАК ВТ_Основная
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК РЭ_Контрагенты
	                      |		ПО ВТ_Основная.Контрагент = РЭ_Контрагенты.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВТ_Основная.Отход.Наименование");
	Запрос.УстановитьПараметр("Начало", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("Конец", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	
	Результат = Запрос.Выполнить().Выбрать(); 
	
	ТабДок.Очистить(); 
	ТабДок.Вывести(Шапка);    
	
	НомерСтроки = 1;
	
	Пока Результат.Следующий() Цикл
		
		Строка.Параметры.Заполнить(Результат);
		Строка.Параметры.НомерСтроки = НомерСтроки;
		ТабДок.Вывести(Строка);   
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
Процедура Квартальный3(Команда)
	Квартальный3НаСервере();
КонецПроцедуры

&НаСервере
Процедура Квартальный3НаСервере()
	Макет = Отчеты.ОтчетОтходыПоПериуду.ПолучитьМакет("Квартальный3");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Очистить(); 
	ТабДок.Вывести(Шапка); 	
КонецПроцедуры
