
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИмяПользователя = ИмяПользователя();
	ЭтотОбъект.Владелец = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ПроверкаДубляПоВладельцу() Тогда
		Сообщить("ИНН уже используется");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ПроверкаДубляПоВладельцу()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Организации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Организации КАК Организации
	                      |ГДЕ
	                      |	(Организации.Владелец = &Владелец
	                      |			ИЛИ Организации.Владелец = &Администратор)
	                      |	И Организации.ИНН = &ИНН"); 
	Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Владелец);
	Запрос.УстановитьПараметр("Администратор", Справочники.Пользователи.НайтиПоНаименованию("Администратор"));
	Запрос.УстановитьПараметр("ИНН", ЭтотОбъект.ИНН);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции