
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОтходыПолученные 
	Движения.ОтходыПолученные.Записывать = Истина;
	Для Каждого ТекСтрокаОтходы Из Отходы Цикл
		Движение = Движения.ОтходыПолученные.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Отход = ТекСтрокаОтходы.Отход;
		Движение.ДействияСОтходом = ТекСтрокаОтходы.ДействияСОтходом;
		Движение.Количество = ТекСтрокаОтходы.Количество;
		Движение.СпособПолучения = ТекСтрокаОтходы.СпособПолучения;
		Движение.ЦельПередачи = ТекСтрокаОтходы.ЦельПередачи;
		Движение.КонтрагентПередачи = ТекСтрокаОтходы.КонтрагентПередачи;
		Движение.ДоговорПередачи = ТекСтрокаОтходы.ДоговорПередачи;
	КонецЦикла;

	// регистр ОтходыПоДействию 
	Движения.ОтходыПоДействию.Записывать = Истина;
	Для Каждого ТекСтрокаОтходы Из Отходы Цикл
		Движение = Движения.ОтходыПоДействию.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Отход = ТекСтрокаОтходы.Отход;
		Движение.ДействиеСОтходом = ТекСтрокаОтходы.ДействияСОтходом;
		Движение.Количество = ТекСтрокаОтходы.Количество;
	КонецЦикла;

	// регистр ОтходыПоЦелиПередачи 
	Движения.ОтходыПоЦелиПередачи.Записывать = Истина;
	Для Каждого ТекСтрокаОтходы Из Отходы Цикл
		Движение = Движения.ОтходыПоЦелиПередачи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Отход = ТекСтрокаОтходы.Отход;
		Движение.ЦельПередачи = ТекСтрокаОтходы.ЦельПередачи;
		Движение.Количество = ТекСтрокаОтходы.КоличествоЦель;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ  
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
	СуммаОтходов = ЭтотОбъект.Отходы.Итог("Количество");
КонецПроцедуры
