


//&НаКлиенте
//Процедура ОтправитьСообщение(Команда)
//	
//		ОтправитьСообщениеКлиент();
//	                            
//КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеКлиент(Номер) Экспорт
	
	КлиентКомпоненты = ПолучитьКомпонентуКлиент();
	ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, Номер);
	
КонецПроцедуры     

&НаКлиенте
Функция ПолучитьКомпонентуКлиент()
	
	Клиент = Неопределено;
	
	ПодключитьКомпонентуКлиент();
	ИнициализироватьКомпонентуКлиентСервер(Клиент);
		
	Возврат Клиент;
	
КонецФункции

Процедура ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, Номер)
	
	Попытка
		КлиентКомпоненты.Connect(
			"localhost",
			5672,
			"guest",
			"guest",
			"TKO");
		
		ТочкаОбмена    = "BP";
		ИмяОчереди     = "BP";
		ТекстСообщения = Номер;
		КлючМаршрутизации = "BP.1";
		
		КлиентКомпоненты.BasicPublish(
			ТочкаОбмена,
			КлючМаршрутизации,
			ТекстСообщения,
			1,
			Ложь);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Сообщение успешно отправлено!");
КонецПроцедуры                          

&НаКлиенте
Процедура ПодключитьКомпонентуКлиент()
	
	КомпонентаПодключена = Неопределено;
	
	АдресВоВременномХранилище = РаботаСRabbitMQСервер.ПолучитьАдресМакетаКомпановкиНаСервере();
	
	УстановитьВнешнююКомпоненту(АдресВоВременномХранилище);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	//Сообщить(НСтр("ru = 'Компонента подключена!'"));
	
КонецПроцедуры

Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции



